reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
// ===========================================================================
//  Athena Rover 2026 — Firmware ESP32-S3 AUTÓNOMO (sin Raspberry Pi)
//  Retos del Rover H07 · INTEC · Reymildo & Montse
// ===========================================================================
//
//  Variante de firmware-esp32/src/main.cpp para la DEMOSTRACIÓN: aquí la
//  misión completa (percibir -> decidir -> mover) corre DENTRO del ESP32-S3,
//  en su propia tarea de FreeRTOS (MissionTask). No hay enlace serial con
//  ninguna computadora ni cámara: el robot arranca, hace su ronda solo, y se
//  detiene. Cada subsistema de hardware sigue en su propia tarea, igual que
//  en la versión con Raspberry Pi, comunicadas SOLO por colas explícitas.
//
//  QUÉ SE PUEDE HACER SIN RASPBERRY PI Y QUÉ NO
//  ----------------------------------------------------------------------
//  El ESP32-S3 por sí solo NO tiene cámara: no puede reconocer la forma ni
//  el color de un objeto lejano, solo leer sensores de contacto/proximidad
//  y el color del piso justo debajo de sí. Con eso alcanza para:
//    ✔ Identificar las líneas/zonas de piso negro, amarillo, rojo y azul
//      (TCS34725, igual que la versión con Raspberry Pi).
//    ✔ Cargar y depositar la llave: se asume que un operador la coloca a
//      mano en la pinza abierta antes de encender el robot (igual que
//      asume raspberry-pi/src/athena/decision.py en su fase INICIO) — el
//      firmware la sujeta, la transporta a la zona amarilla y la suelta.
//    ✔ Trasladar la bandera una vez agarrada: cerrar la pinza, volver a la
//      zona propia (reconocida por el color de piso) y soltarla ahí.
//    ✘ Encontrar Y VERIFICAR que lo que agarra es específicamente la
//      bandera DEL EQUIPO CONTRARIO. Sin cámara no hay forma de distinguir
//      "bandera roja" de "bandera azul" ni de "un objeto cualquiera" a
//      distancia. Este firmware usa el VL53L1X (telémetro delante del
//      gripper) como sustituto: durante la búsqueda, barre el área y
//      cierra la pinza sobre lo primero sólido que encuentra a corta
//      distancia. Es una heurística, no una detección real — documentado
//      a propósito, no es un descuido. Para "detectar la bandera del
//      oponente" de verdad hace falta la cámara + Edge Impulse de
//      raspberry-pi/src/athena/ei_flag_detector.py (ver firmware-esp32/).
//
//  LED RGB: INDICADOR PURO DE LA LÍNEA/ZONA DE PISO, nada más
//  ----------------------------------------------------------------------
//    · Piso gris (zona neutra) o sin lectura válida -> APAGADO.
//    · Amarillo / rojo / azul -> ese mismo color, fijo, mientras el sensor
//      delantero esté sobre esa zona.
//    · Negro (borde) -> destello alternando rojo/azul, como alerta.
//  El LED YA NO indica equipo ni "veo la bandera": esta variante lo dedica
//  por completo a decir en qué línea está parado el robot.
//
//  TEAM_SELECT: sin Raspberry Pi que le diga "--equipo rojo/azul" por
//  línea de comandos, el equipo se elige con un puente físico a GND en el
//  GPIO Pins::TEAM_SELECT (ver más abajo) — leído UNA vez al arrancar.
//
//  HARDWARE (idéntico a firmware-esp32/, más el puente TEAM_SELECT):
//    · 2x L298N            -> 4 motores (cada driver mueve 2)
//    · 1x PCA9685 (I2C)    -> 2 servos del gripper (pinza + elevación)
//    · 2x TCS34725 (I2C)   -> sensor de color delantero y trasero
//    · 1x VL53L1X (I2C)    -> telémetro delante del gripper
//    · 2x QTRX-HD-01A      -> reflectancia delantera izquierda y derecha
//    · LED RGB (1x)        -> indicador puro de la línea/zona de piso
//    · Puente TEAM_SELECT  -> GND = ROJO, sin conectar (pull-up) = AZUL
//
//  ÍNDICE
//    [1] Configuración: pines, prioridades, stacks, periodos
//    [2] Tipos compartidos entre tareas
//    [3] Colas
//    [4] Watchdog cooperativo (heartbeats)
//    [5] Driver PCA9685 (servos por I2C)
//    [6] Driver TCS34725 (sensores de color por I2C)
//    [7] Clasificación de color -> etiqueta de zona
//    [8] Tareas de hardware (motores, gripper, color, reflectancia, ToF, LED)
//    [9] MissionTask — el cerebro: percibir -> decidir -> mover, sin RPi
//    [10] setup() / loop()
//
// ===========================================================================

#include <Arduino.h>
#include <Wire.h>
#include <VL53L1X.h>
#include <freertos/semphr.h>   // SemaphoreHandle_t / mutex del bus I2C nº0 (ver g_i2c0Mutex)
#include <esp_system.h>        // esp_reset_reason() — ver el log de motivo de reinicio en setup()

// ===========================================================================
//  [1] CONFIGURACIÓN
// ===========================================================================
//
//  PINES PROHIBIDOS en el ESP32-S3 DevKitC-1 — respetarlos no es opcional:
//    GPIO 19, 20    -> USB nativo (D-/D+).
//    GPIO 43, 44    -> U0TXD/U0RXD, puerto de programación y depuración.
//    GPIO 26..32    -> flash SPI interna. Tocarlos cuelga el chip.
//    GPIO 33..37    -> PSRAM Octal (módulos N8R8/N16R8). Igual de intocables.
//    GPIO 0, 45, 46 -> pines de strapping: su nivel al arranque decide el modo
//                      de boot. Evitarlos.
//    GPIO 3         -> strapping de JTAG. Se puede usar, pero mejor no.
//
//  Además: los sensores analógicos DEBEN ir en ADC1 (GPIO 1..10). El ADC2
//  queda inutilizable en cuanto se enciende el WiFi.

namespace Pins {
    // -------- Motores: 2x L298N, cada uno mueve 2 motores ------------------
    constexpr uint8_t L298N_L_IN1 = 4;    // FL sentido A
    constexpr uint8_t L298N_L_IN2 = 5;    // FL sentido B
    constexpr uint8_t L298N_L_ENA = 6;    // FL velocidad (PWM)
    constexpr uint8_t L298N_L_IN3 = 7;    // RL sentido A
    constexpr uint8_t L298N_L_IN4 = 15;   // RL sentido B
    constexpr uint8_t L298N_L_ENB = 16;   // RL velocidad (PWM)

    constexpr uint8_t L298N_R_IN1 = 10;   // FR sentido A
    constexpr uint8_t L298N_R_IN2 = 11;   // FR sentido B
    constexpr uint8_t L298N_R_ENA = 12;   // FR velocidad (PWM)
    constexpr uint8_t L298N_R_IN3 = 13;   // RR sentido A
    constexpr uint8_t L298N_R_IN4 = 14;   // RR sentido B
    constexpr uint8_t L298N_R_ENB = 17;   // RR velocidad (PWM)

    // -------- Bus I2C nº0: PCA9685 (servos) + TCS34725 DELANTERO -----------
    constexpr uint8_t I2C0_SDA = 8;
    constexpr uint8_t I2C0_SCL = 9;

    // -------- Bus I2C nº1: TCS34725 TRASERO --------------------------------
    // Los dos TCS34725 comparten la misma dirección fija (0x29): van en buses
    // separados para no necesitar un multiplexor TCA9548A.
    constexpr uint8_t I2C1_SDA = 47;
    constexpr uint8_t I2C1_SCL = 48;

    // -------- LED de iluminación de cada TCS34725 ---------------------------
    constexpr uint8_t TCS_LED_FRONT = 18;
    constexpr uint8_t TCS_LED_BACK  = 21;

    // -------- VL53L1X (ToF), delante del gripper ---------------------------
    // Comparte el bus I2C nº0 con el TCS34725 delantero (mismo 0x29 de
    // fábrica): XSHUT lo mantiene en reset hasta reasignarle dirección.
    constexpr uint8_t TOF_XSHUT = 3;

    // -------- Reflectancia QTRX-HD-01A (salida analógica) ------------------
    // ¡ALIMENTARLOS A 3.3 V! Ver la nota larga en ReflectanceTask.
    constexpr uint8_t QTR_LEFT_OUT  = 1;  // GPIO1 = ADC1_CH0
    constexpr uint8_t QTR_RIGHT_OUT = 2;  // GPIO2 = ADC1_CH1
    constexpr uint8_t QTR_EMITTER_CTRL = 42;

    // -------- LED RGB indicador de equipo / zona / bandera ------------------
    constexpr uint8_t LED_RGB_R = 39;
    constexpr uint8_t LED_RGB_G = 38;
    constexpr uint8_t LED_RGB_B = 41;

    // -------- Selector de equipo, SOLO en esta variante autónoma -----------
    // GPIO40 quedó libre en el robot (ver historial de firmware-esp32/: el
    // XSHUT del VL53L1X se corrió de aquí al 3, y el canal azul del LED al
    // 41). INPUT_PULLUP: puente a GND = ROJO, sin puente = ROJO también NO
    // — hace falta un nivel por defecto explícito, y se eligió que "sin
    // puente" (HIGH, el pull-up interno) sea AZUL. Leído una sola vez en
    // setup(): cambiarlo exige reiniciar el ESP32, que es exactamente lo que
    // ya se hace entre rondas para reflashear o solo repotenciar.
    constexpr uint8_t TEAM_SELECT = 40;
}

