reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
    for (;;) {
        if (!pca_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c0Lock()) {
                pca_ok = Pca9685::Init(Pwm::SERVO_FREQ_HZ);
                // Si el PCA9685 no respondió al arrancar (arriba se saltó el
                // SetChannel inicial) y recién ahora reaparece, hay que
                // mandar la pinza a 0° aquí también — si no, se queda
                // esperando un GripperCommand que puede no llegar nunca (por
                // ejemplo, con Mission::kMotionEnabled en false, que no
                // manda ninguno).
                if (pca_ok) {
                    pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
                }
                I2c0Unlock();
            }
        }

        GripperCommand cmd;
        if (xQueueReceive(g_gripperCmdQueue, &cmd, 0) == pdTRUE && pca_ok) {
            if (I2c0Lock()) {
                switch (cmd.action) {
                    case GripperAction::OPEN:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
                        break;
                    case GripperAction::CLOSE_LLAVE:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawClosedLlaveDeg));
                        break;
                    case GripperAction::CLOSE_BANDERA:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawClosedBanderaDeg));
                        break;
                    default:
                        break;   // RAISE/LOWER: sin servo de elevación montado
                }
                I2c0Unlock();
            }
        }

        Heartbeat(TaskId::GRIPPER_CONTROL);
        vTaskDelayUntil(&last_wake, period);
    }
}

template <typename T>
void PushDropOldest(QueueHandle_t queue, const T &item) {
    if (xQueueSend(queue, &item, 0) != pdTRUE) {
        T discard;
        xQueueReceive(queue, &discard, 0);
        xQueueSend(queue, &item, 0);
    }
}

// ---------------------------------------------------------------------------
//  8.3  TofSensorTask — VL53L1X, telémetro delante del gripper
// ---------------------------------------------------------------------------
//  Aquí es donde este firmware hace más trabajo que en la versión con
//  Raspberry Pi: sin cámara, esta es la ÚNICA fuente de "algo delante" que
//  tiene MissionTask para intentar agarrar la bandera. Ver el aviso grande
//  al principio del archivo sobre esta limitación.

namespace Tof {
    constexpr uint32_t BOOT_DELAY_MS = 2;
    constexpr uint16_t TIMING_BUDGET_US = 50000;
    constexpr uint32_t RANGING_PERIOD_MS = 50;
}

VL53L1X g_tof;

bool TofBringUp() {
    g_tof.setBus(&Wire);
    g_tof.setTimeout(500);
    g_tof.setAddress(I2CAddr::VL53L1X);

    if (!g_tof.init()) return false;

    g_tof.setDistanceMode(VL53L1X::Long);
    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
    return true;
}

void TofSensorTask(void *) {
    digitalWrite(Pins::TOF_XSHUT, HIGH);
    delay(Tof::BOOT_DELAY_MS);

    // TofBringUp() incluye la reasignación de dirección del VL53L1X (ver la
    // nota larga en I2CAddr::VL53L1X_BOOT_ADDR): esa escritura ocurre
    // mientras el chip todavía responde en 0x29, la MISMA dirección del
    // TCS34725 delantero. Antes esto era "un riesgo acotado y aceptado";
    // con el mutex del bus (ver g_i2c0Mutex) deja de ser un riesgo: mientras
    // se sostiene el lock, ColorSensorTask no puede tocar el bus, así que
    // las dos direcciones nunca coinciden con dos transacciones activas a
    // la vez.
    bool tof_ok = false;
    if (I2c0Lock()) {
        tof_ok = TofBringUp();
        I2c0Unlock();
    }
    if (!tof_ok) {
        DEBUG_LINK.println("[ToF] VL53L1X no responde. Reintentando en segundo plano.");
    }

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::TOF_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        if (!tof_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c0Lock()) {
                tof_ok = g_tof.init();
                if (tof_ok) {
                    g_tof.setDistanceMode(VL53L1X::Long);
                    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
                    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
                }
                I2c0Unlock();
            }
        }

        TofReading reading;
        reading.timestamp_ms = millis();

        if (tof_ok && I2c0Lock()) {
            if (g_tof.dataReady()) {
                reading.distance_mm = g_tof.read(false);
                reading.valid = !g_tof.timeoutOccurred() &&
                                g_tof.ranging_data.range_status == VL53L1X::RangeValid;
                if (g_tof.timeoutOccurred()) tof_ok = false;
            }
            I2c0Unlock();
        }

        PushDropOldest(g_tofQueue, reading);

        Heartbeat(TaskId::TOF_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.4  ColorSensorTask — TCS34725 delantero (Wire) y trasero (Wire1)
// ---------------------------------------------------------------------------

void ColorSensorTask(void *) {
    pinMode(Pins::TCS_LED_FRONT, OUTPUT);
    pinMode(Pins::TCS_LED_BACK, OUTPUT);
    digitalWrite(Pins::TCS_LED_FRONT, HIGH);
    digitalWrite(Pins::TCS_LED_BACK, HIGH);

    // El sensor DELANTERO vive en Wire (bus I2C nº0), el mismo que el
    // PCA9685 y el VL53L1X: sus llamadas van protegidas por g_i2c0Mutex
    // (ver la nota larga junto a su declaración). El TRASERO vive solo en
    // Wire1 (bus nº1): nadie más lo toca, así que no necesita el mutex.
    bool front_ok = false;
    if (I2c0Lock()) {
        front_ok = Tcs34725::Init(Wire);
        I2c0Unlock();
    }
    bool back_ok = Tcs34725::Init(Wire1);

    if (!front_ok) DEBUG_LINK.println("[Color] sensor DELANTERO no responde (bus I2C 0).");
    if (!back_ok)  DEBUG_LINK.println("[Color] sensor TRASERO no responde (bus I2C 1).");

