reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::COLOR_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        if ((!front_ok || !back_ok) && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (!front_ok && I2c0Lock()) {
                front_ok = Tcs34725::Init(Wire);
                I2c0Unlock();
            }
            if (!back_ok) back_ok = Tcs34725::Init(Wire1);
        }

        ColorReading reading;
        reading.timestamp_ms = millis();

        Tcs34725::Rgbc sample;
        if (front_ok) {
            bool read_ok = false;
            if (I2c0Lock()) {
                read_ok = Tcs34725::Read(Wire, sample);
                I2c0Unlock();
            }
            if (read_ok) {
                reading.front = ClassifyColor(sample);
                reading.front_valid = true;
            } else {
                front_ok = false;
            }
        }

        if (back_ok && Tcs34725::Read(Wire1, sample)) {
            reading.back = ClassifyColor(sample);
            reading.back_valid = true;
        } else {
            back_ok = false;
        }

        PushDropOldest(g_colorQueue, reading);

        Heartbeat(TaskId::COLOR_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.5  ReflectanceTask — 2x QTRX-HD-01A
// ---------------------------------------------------------------------------
//  Valor ADC ALTO = superficie OSCURA (cinta negra del borde). Ver la nota
//  larga en firmware-esp32/src/main.cpp si esto no es intuitivo.

constexpr uint16_t kDarkThreshold = 2048;   // TODO: calibrar en la pista real

void ReflectanceTask(void *) {
    analogReadResolution(12);
    analogSetPinAttenuation(Pins::QTR_LEFT_OUT, ADC_11db);
    analogSetPinAttenuation(Pins::QTR_RIGHT_OUT, ADC_11db);

    pinMode(Pins::QTR_EMITTER_CTRL, OUTPUT);
    digitalWrite(Pins::QTR_EMITTER_CTRL, HIGH);

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::REFLECTANCE);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        ReflectanceReading reading;
        reading.timestamp_ms  = millis();
        reading.left_raw      = (uint16_t)analogRead(Pins::QTR_LEFT_OUT);
        reading.right_raw     = (uint16_t)analogRead(Pins::QTR_RIGHT_OUT);
        reading.left_on_line  = reading.left_raw  > kDarkThreshold;
        reading.right_on_line = reading.right_raw > kDarkThreshold;

        PushDropOldest(g_reflectQueue, reading);

        Heartbeat(TaskId::REFLECTANCE);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.6  LedTask — LED RGB: indicador puro de la línea/zona de piso
// ---------------------------------------------------------------------------
//  Único trabajo del LED en esta variante: decir sobre qué está parado el
//  robot AHORA MISMO, nada más — ni equipo, ni "veo la bandera".
//    · Piso gris (FLOOR) o sin lectura válida -> apagado.
//    · Amarillo / rojo / azul                 -> ese mismo color, fijo.
//    · Negro (borde)                          -> destello alternando
//                                                 rojo/azul, como alerta.

namespace RgbLed {
    constexpr uint8_t CH_R = 4;
    constexpr uint8_t CH_G = 5;
    constexpr uint8_t CH_B = 6;

    // POLARIDAD SIN CONFIRMAR con el LED físico: se asume cátodo común. Si
    // los colores salen invertidos, cambiar a true (ver firmware-esp32/).
    constexpr bool kCommonAnode = false;

    void Setup() {
        PwmAttach(Pins::LED_RGB_R, CH_R, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_G, CH_G, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_B, CH_B, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
    }

    void SetRaw(uint8_t r, uint8_t g, uint8_t b) {
        if (kCommonAnode) { r = 255 - r; g = 255 - g; b = 255 - b; }
        PwmWrite(Pins::LED_RGB_R, CH_R, r);
        PwmWrite(Pins::LED_RGB_G, CH_G, g);
        PwmWrite(Pins::LED_RGB_B, CH_B, b);
    }

    // Color fijo de las zonas que NO parpadean. BLACK no aparece aquí a
    // propósito: LedTask lo maneja aparte, alternando rojo/azul.
    void ApplyZone(ColorLabel zone) {
        switch (zone) {
            case ColorLabel::YELLOW: SetRaw(255, 170, 0); break;
            case ColorLabel::RED:    SetRaw(255, 0, 0);   break;
            case ColorLabel::BLUE:   SetRaw(0, 0, 255);   break;
            case ColorLabel::BLACK:
            case ColorLabel::FLOOR:
            case ColorLabel::UNKNOWN:
            default:
                SetRaw(0, 0, 0);   // apagado: piso neutro o sin lectura
                break;
        }
    }
}

// Cuántas vueltas de LedTask dura cada mitad del destello rojo/azul sobre
// el borde negro. A TaskPeriodMs::LED_STATUS (100 ms) y 3 vueltas por
// mitad, el ciclo completo dura 600 ms (~1.7 Hz): lo bastante lento para
// distinguir los dos colores a simple vista, no un borrón.
constexpr uint32_t kBorderBlinkHalfPeriodTicks = 3;

void LedTask(void *) {
    RgbLed::Setup();
    RgbLed::SetRaw(0, 0, 0);

    ColorLabel zone = ColorLabel::UNKNOWN;
    uint32_t   blink_tick = 0;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::LED_STATUS);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        LedCommand cmd;
        if (xQueueReceive(g_ledCmdQueue, &cmd, 0) == pdTRUE) {
            zone = cmd.zone;
        }

        if (zone == ColorLabel::BLACK) {
            blink_tick = (blink_tick + 1) % (2 * kBorderBlinkHalfPeriodTicks);
            if (blink_tick < kBorderBlinkHalfPeriodTicks) {
                RgbLed::SetRaw(255, 0, 0);
            } else {
                RgbLed::SetRaw(0, 0, 255);
            }
        } else {
            blink_tick = 0;
            RgbLed::ApplyZone(zone);
        }

        Heartbeat(TaskId::LED_STATUS);
        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo (tareas de hardware)

