reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
// ===========================================================================
//  [9] MISSIONTASK — el cerebro, sin Raspberry Pi
// ===========================================================================
//
//  Puerto directo de la lógica de raspberry-pi/src/athena/decision.py a
//  C++, adaptado a que aquí NO hay percepción visual de la bandera: donde
//  decision.py usaba ``perception.best(bandera_objetivo)`` (una detección
//  de la cámara con clase, ángulo y distancia), esta versión usa el
//  VL53L1X como sustituto ciego — ver el aviso grande al principio del
//  archivo. Las prioridades y el orden de fases son EXACTAMENTE los mismos
//  que allá, por la misma razón: salirse de la pista y adelantar la
//  secuencia pierden la ronda de inmediato, así que esas dos reglas no
//  pueden depender de que nada más ande bien.

namespace Mission {

// Interruptor de emergencia por batería baja: en false, MissionTask NO
// mueve motores ni el gripper — solo lee los sensores y deja que el LED
// (LedTask) siga mostrando la zona de piso. Poner en true para que el
// robot vuelva a ejecutar la misión completa.
constexpr bool kMotionEnabled = false;

// Velocidades y umbrales — mismo rol que ControlConfig en decision.py,
// pero constexpr porque aquí no hay archivo de configuración que cargar.
constexpr int kVelocidadCrucero     = 45;   // % de PWM al avanzar recto
constexpr int kVelocidadBusqueda    = 35;   // % al girar buscando
constexpr int kVelocidadAproximacion = 30;  // % al acercarse / evadir

constexpr uint16_t kDistanciaAgarreMm = 150;  // debajo de esto: cerrar la pinza
constexpr uint8_t  kTofDebounceHits   = 3;    // lecturas seguidas antes de agarrar

constexpr uint32_t kStartupDelayMs   = 3000;  // tiempo para cargar la llave y ubicar el robot
constexpr uint32_t kGripperSettleMs  = 400;   // tiempo mecánico para que el servo llegue
constexpr uint32_t kSpinBurstMs      = 900;   // barrido: cuánto gira sobre su eje
constexpr uint32_t kForwardBurstMs   = 700;   // barrido: cuánto avanza entre giros
constexpr uint32_t kReturnTurnMs     = 1500;  // giro aproximado de 180°, A CALIBRAR EN BANCO

enum class Phase : uint8_t {
    ARRANQUE = 0,
    ASEGURAR_LLAVE,
    BUSCAR_ZONA_NEUTRA,
    DEPOSITAR_LLAVE,
    BUSCAR_BANDERA,
    AGARRAR_BANDERA,
    RETORNAR_GIRANDO,
    RETORNAR_AVANZANDO,
    ENTREGAR,
    TERMINADO,
};

inline ColorLabel ZonaPropia(TeamColor team) {
    return (team == TeamColor::RED) ? ColorLabel::RED : ColorLabel::BLUE;
}

} // namespace Mission

// Evita depender de que el compilador trate a MotorCommand como agregado
// con inicializadores por defecto (necesita C++14+); igual que hace
// firmware-esp32/src/main.cpp, se asigna campo a campo.
inline void SetDrive(MotorCommand &m, int left, int right) {
    m.mode  = MotorMode::DRIVE;
    m.left  = (int8_t)constrain(left, -100, 100);
    m.right = (int8_t)constrain(right, -100, 100);
}

void MissionTask(void *pvTeam) {
    const TeamColor team = *reinterpret_cast<TeamColor *>(pvTeam);

    Mission::Phase phase = Mission::Phase::ARRANQUE;
    Mission::Phase last_logged_phase = phase;
    uint32_t phase_started_ms = millis();

    // Estado propio del barrido de búsqueda (fase BUSCAR_BANDERA).
    bool     buscando_gira = true;
    int8_t   sentido = 1;
    uint8_t  tof_hits = 0;

    ColorReading       last_color{};
    ReflectanceReading last_reflect{};
    TofReading         last_tof{};

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::MISSION);
    TickType_t last_wake = xTaskGetTickCount();

    DEBUG_LINK.printf("[Mission] equipo = %s\n", team == TeamColor::RED ? "ROJO" : "AZUL");

    for (;;) {
        // --- 0. Refrescar la última lectura de cada sensor -----------------
        // Igual que hacía run_rover.py: se drena toda la cola y solo importa
        // el dato más reciente de cada tipo.
        ColorReading c;
        while (xQueueReceive(g_colorQueue, &c, 0) == pdTRUE) last_color = c;
        ReflectanceReading r;
        while (xQueueReceive(g_reflectQueue, &r, 0) == pdTRUE) last_reflect = r;
        TofReading t;
        while (xQueueReceive(g_tofQueue, &t, 0) == pdTRUE) last_tof = t;
        HealthReport h;
        while (xQueueReceive(g_healthQueue, &h, 0) == pdTRUE) {
            DEBUG_LINK.printf("[Mission] tareas colgadas, bitmask=0x%02X\n", h.faulted_tasks_bitmask);
        }

        MotorCommand motor;               // por defecto: STOP
        GripperCommand gripper;
        bool send_gripper = false;

        // Interruptor de batería baja (Mission::kMotionEnabled): si está en
        // false, todo lo de aquí abajo se salta por completo. motor se queda
        // en su valor por defecto (STOP) y gripper nunca se envía — el
        // robot no mueve nada, solo sigue leyendo sensores y mostrando la
        // zona por el LED (eso pasa siempre, fuera de este bloque).
        if (Mission::kMotionEnabled) {

        // --- 1. PRIORIDAD MÁXIMA: no salirse de la pista -------------------
        // Idéntico a decision.py::_evadir_borde: pisa cualquier otra fase.
        bool evadiendo = false;
        if (last_reflect.left_on_line && last_reflect.right_on_line) {
            SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion);
            evadiendo = true;
        } else if (last_reflect.left_on_line) {
            SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion / 3);
            evadiendo = true;
        } else if (last_reflect.right_on_line) {
            SetDrive(motor, -Mission::kVelocidadAproximacion / 3, -Mission::kVelocidadAproximacion);
            evadiendo = true;
        }

        // Ayuda a depurar en banco: cambiar de fase se ve en el monitor
        // serial sin tener que instrumentar cada rama.
        if (phase != last_logged_phase) {
            DEBUG_LINK.printf("[Mission] fase -> %d\n", (int)phase);
            last_logged_phase = phase;
        }

        if (!evadiendo) {
            switch (phase) {

                // -- 2. Cuenta regresiva para cargar la llave a mano --------
                case Mission::Phase::ARRANQUE: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kStartupDelayMs) {
                        phase = Mission::Phase::ASEGURAR_LLAVE;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 3. Asegurar la llave que el operador ya colocó ---------
                case Mission::Phase::ASEGURAR_LLAVE: {
                    gripper.action = GripperAction::CLOSE_LLAVE;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::BUSCAR_ZONA_NEUTRA;
                        phase_started_ms = millis();
                    }
                    break;
                }

